CSI API ETABS v1
cAnalysisResults.BaseReactWithCentroid Method
 Reports the structure total base reactions and includes information on the centroid of the translational reaction forces
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int BaseReactWithCentroid(
	ref int NumberResults,
	ref string[] LoadCase,
	ref string[] StepType,
	ref double[] StepNum,
	ref double[] FX,
	ref double[] FY,
	ref double[] FZ,
	ref double[] MX,
	ref double[] ParamMy,
	ref double[] MZ,
	ref double GX,
	ref double GY,
	ref double GZ,
	ref double[] XCentroidForFX,
	ref double[] YCentroidForFX,
	ref double[] ZCentroidForFX,
	ref double[] XCentroidForFY,
	ref double[] YCentroidForFY,
	ref double[] ZCentroidForFY,
	ref double[] XCentroidForFZ,
	ref double[] YCentroidForFZ,
	ref double[] ZCentroidForFZ
)
Function BaseReactWithCentroid (
	ByRef NumberResults As Integer,
	ByRef LoadCase As String(),
	ByRef StepType As String(),
	ByRef StepNum As Double(),
	ByRef FX As Double(),
	ByRef FY As Double(),
	ByRef FZ As Double(),
	ByRef MX As Double(),
	ByRef ParamMy As Double(),
	ByRef MZ As Double(),
	ByRef GX As Double,
	ByRef GY As Double,
	ByRef GZ As Double,
	ByRef XCentroidForFX As Double(),
	ByRef YCentroidForFX As Double(),
	ByRef ZCentroidForFX As Double(),
	ByRef XCentroidForFY As Double(),
	ByRef YCentroidForFY As Double(),
	ByRef ZCentroidForFY As Double(),
	ByRef XCentroidForFZ As Double(),
	ByRef YCentroidForFZ As Double(),
	ByRef ZCentroidForFZ As Double()
) As Integer
Dim instance As cAnalysisResults
Dim NumberResults As Integer
Dim LoadCase As String()
Dim StepType As String()
Dim StepNum As Double()
Dim FX As Double()
Dim FY As Double()
Dim FZ As Double()
Dim MX As Double()
Dim ParamMy As Double()
Dim MZ As Double()
Dim GX As Double
Dim GY As Double
Dim GZ As Double
Dim XCentroidForFX As Double()
Dim YCentroidForFX As Double()
Dim ZCentroidForFX As Double()
Dim XCentroidForFY As Double()
Dim YCentroidForFY As Double()
Dim ZCentroidForFY As Double()
Dim XCentroidForFZ As Double()
Dim YCentroidForFZ As Double()
Dim ZCentroidForFZ As Double()
Dim returnValue As Integer
returnValue = instance.BaseReactWithCentroid(NumberResults,
	LoadCase, StepType, StepNum, FX, FY,
	FZ, MX, ParamMy, MZ, GX, GY, GZ, XCentroidForFX,
	YCentroidForFX, ZCentroidForFX,
	XCentroidForFY, YCentroidForFY,
	ZCentroidForFY, XCentroidForFZ,
	YCentroidForFZ, ZCentroidForFZ)
int BaseReactWithCentroid(
	int% NumberResults,
	array<String^>^% LoadCase,
	array<String^>^% StepType,
	array<double>^% StepNum,
	array<double>^% FX,
	array<double>^% FY,
	array<double>^% FZ,
	array<double>^% MX,
	array<double>^% ParamMy,
	array<double>^% MZ,
	double% GX,
	double% GY,
	double% GZ,
	array<double>^% XCentroidForFX,
	array<double>^% YCentroidForFX,
	array<double>^% ZCentroidForFX,
	array<double>^% XCentroidForFY,
	array<double>^% YCentroidForFY,
	array<double>^% ZCentroidForFY,
	array<double>^% XCentroidForFZ,
	array<double>^% YCentroidForFZ,
	array<double>^% ZCentroidForFZ
)
abstract BaseReactWithCentroid :
        NumberResults : int byref *
        LoadCase : string[] byref *
        StepType : string[] byref *
        StepNum : float[] byref *
        FX : float[] byref *
        FY : float[] byref *
        FZ : float[] byref *
        MX : float[] byref *
        ParamMy : float[] byref *
        MZ : float[] byref *
        GX : float byref *
        GY : float byref *
        GZ : float byref *
        XCentroidForFX : float[] byref *
        YCentroidForFX : float[] byref *
        ZCentroidForFX : float[] byref *
        XCentroidForFY : float[] byref *
        YCentroidForFY : float[] byref *
        ZCentroidForFY : float[] byref *
        XCentroidForFZ : float[] byref *
        YCentroidForFZ : float[] byref *
        ZCentroidForFZ : float[] byref -> int
Parameters
NumberResults
Type: System.Int32
 The total number of results returned by the program
LoadCase
Type: System.String[]
 This is an array that includes the name of the analysis case or load combination associated with each result
StepType
Type: System.String[]
 This is an array that includes the step type, if any, for each result
StepNum
Type: System.Double[]
 This is an array that includes the step number, if any, for each result
FX
Type: System.Double[]
 This array contains the base reaction force in the global X direction for each result. [F]
FY
Type: System.Double[]
 This array contains the base reaction force in the global Y direction for each result. [F]
FZ
Type: System.Double[]
 This array contains the base reaction force in the global Z direction for each result. [F]
MX
Type: System.Double[]
 This array contains the base reaction moment about the global X axis for each result. [FL]
ParamMy
Type: System.Double[]
 This array contains the base reaction moment about the global Y axis for each result. [FL]
MZ
Type: System.Double[]
 This array contains the base reaction moment about the global Z axis for each result. [FL]
GX
Type: System.Double
 The global X coordinate of the point at which the base reactions are reported. [L]
GY
Type: System.Double
 The global Y coordinate of the point at which the base reactions are reported. [L]
GZ
Type: System.Double
 The global Z coordinate of the point at which the base reactions are reported. [L]
XCentroidForFX
Type: System.Double[]
 This is an array of the global X coordinates of the centroid of all global X-direction translational reaction forces for each result. [L]
YCentroidForFX
Type: System.Double[]
 This is an array of the global Y coordinates of the centroid of all global X-direction translational reaction forces for each result. [L]
ZCentroidForFX
Type: System.Double[]
 This is an array of the global Z coordinates of the centroid of all global X-direction translational reaction forces for each result. [L]
XCentroidForFY
Type: System.Double[]
 This is an array of the global X coordinates of the centroid of all global Y-direction translational reaction forces for each result. [L]
YCentroidForFY
Type: System.Double[]
 This is an array of the global Y coordinates of the centroid of all global Y-direction translational reaction forces for each result. [L]
ZCentroidForFY
Type: System.Double[]
 This is an array of the global Z coordinates of the centroid of all global Y-direction translational reaction forces for each result. [L]
XCentroidForFZ
Type: System.Double[]
 This is an array of the global X coordinates of the centroid of all global Z-direction translational reaction forces for each result. [L]
YCentroidForFZ
Type: System.Double[]
 This is an array of the global Y coordinates of the centroid of all global Z-direction translational reaction forces for each result. [L]
ZCentroidForFZ
Type: System.Double[]
 This is an array of the global Z coordinates of the centroid of all global Z-direction translational reaction forces for each result. [L]
Return Value
Type: Int32
 Returns zero if the reactions are successfully recovered, otherwise it returns a nonzero value
Remarks
 See Results for more information. Note that the reported base reaction centroids are not the same as the centroid of the applied loads
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim NumberResults As Integer
       Dim LoadCase() As String
       Dim StepType() As String
       Dim StepNum() As Double
       Dim Fx() As Double
       Dim Fy() As Double
       Dim Fz() As Double
       Dim Mx() As Double
       Dim ParamMy() As Double
       Dim Mz() As Double
       Dim gx as Double
       Dim gy as Double
       Dim gz as Double
       Dim XCentroidForFx() As Double
       Dim YCentroidForFx() As Double
       Dim ZCentroidForFx() As Double
       Dim XCentroidForFy() As Double
       Dim YCentroidForFy() As Double
       Dim ZCentroidForFy() As Double
       Dim XCentroidForFz() As Double
       Dim YCentroidForFz() As Double
       Dim ZCentroidForFz() As Double
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'run analysis
       System.IO.Directory.CreateDirectory("c:\CSI_API_temp")
       ret = SapModel.File.Save("C:\CSI_API_temp\example.edb")
       ret = SapModel.Analyze.RunAnalysis()
   'deselect all cases and combos
       ret = SapModel.Results.Setup.DeselectAllCasesAndCombosForOutput()
   'set case selected for output
       ret = SapModel.Results.Setup.SetCaseSelectedForOutput("DEAD")
   'get base reactions with centroids
       ret = SapModel.Results.BaseReactWithCentroid(NumberResults, LoadCase, StepType, StepNum, Fx, Fy, Fz, Mx, My, Mz, gx, gy, gz, XCentroidForFx, YCentroidForFx, ZCentroidForFx, XCentroidForFy, YCentroidForFy, ZCentroidForFy, XCentroidForFz, YCentroidForFz, ZCentroidForFz)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cAnalysisResults Interface
ETABSv1 Namespace